package nu.khamenketkan.waritsara.weightcontrol;

/**
 * Created by Windows 8.1 on 16/7/2559.
 */

//ข้อมูลดิบที่จะเอาไปเก็บไว้ใน SQLite
public class MyData {

    //Explicit
    String[] foodStrings = new String[]{
            "ขกระเพาะปลา",
            "ขกระเพาะปลาตุ๋นน้ำแดง",
            "ขกล้วยไข่",
            "ขกล้วยคลุกมะพร้าว",
            "ข้าวผัดกะเพราเนื้อ",
            "กล้วยฉาบ(ชิ้น)",
            "กล้วยตาก" ,
            "ขกล้วยทอด(ชิ้น)",
            "ขกล้วยน้ำว้า",
            "กล้วยบวชชี",
            "ขกล้วยเล็บมือนาง",
            "กล้วยหอม",
            "ก๋วยจั๊บ",
            "ก๋วยจั๊บญวณ",
            "ก๋วยเตี๋ยวคั่วไก่",
            "ก๋วยเตี๋ยวต้มยำกุ้ง",
            "ก๋วยเตี๋ยวผัดกะเพราไก่",
            "ก๋วยเตี๋ยวผัดไทยใส่ไข่",
            "ก๋วยเตี๋ยวราดหน้าปลากระพง",
            "ก๋วยเตี๋ยวเรือน้ำตก",
            "ก๋วยเตี๋ยวเรือน้ำตกแห้ง",
            "ก๋วยเตี๋ยวเส้นปลาน้ำ",
            "ก๋วยเตี๋ยวเส้นปลาแห้ง",
            "ก๋วยเตี๋ยวเส้นเล็กต้มยำหมู",
            "ก๋วยเตี๋ยวเส้นเล็กหมูแห้ง",
            "ก๋วยเตี๋ยวเส้นหมี่น้ำลูกชิ้นเนื้อวัว",
            "ก๋วยเตี๋ยวเส้นหมี่ลูกชิ้นเนื้อ",
            "ก๋วยเตี๋ยวเส้นใหญ่ผัดซีอิ๊วใส่ไข่",
            "ก๋วยเตี๋ยวเส้นใหญ่ราดหน้าไก่",
            "ก๋วยเตี๋ยวเส้นใหญ่ราดหน้าหมู", "ก๋วยเตี๋ยวหลอด(ชิ้น)","กะหรี่พัฟ","กุ้งแช่น้ำปลา","กุ้งทอดกระเทียมพริกไทย",
            "กุ้งนึ่งกระเทียม","กุ้งผัดพริกอ่อน","กุ้งฝอยชุบแป้งทอด(แพ)","กุ้งอบวุ้นเส้น","กุนเชียงทอด",
            "กุ้ยช่ายทอด(ชิ้น)","เกาเหลาราดหน้า","เกาเหลาลูกชิ้นน้ำ","เกี๊ยวกรอบราดหน้ากุ้ง","เกี๊ยวซ่า(ชิ้น)", "เกี๊ยวน้ำกุ้ง","เกี๊ยวปลาน้ำ",
            "แกงกะหรี่ไก่","แกงกะหรี่หมู","แกงขี้เหล็ก","แกงเขียวหวานไก่","แกงเขียวหวานลูกชิ้นปลากราย",
            "แกงเขียวหวานหมู","แกงจืดไข่เจียว","แกงจืดตำลึงหมูสับ","แกงจืดเต้าหู้ไม่ใส่หมูสับ","แกงจืดเต้าหู้ยัดไส้",
            "แกงจืดถั่วงอกไม่ใส่หมูสับ","แกงจืดถั่วงอกหมูสับ","แกงจืดฟักยัดไส้","แกงจืดมะระยัดไส้","แกงจืดมะระสอดไส้หมูวุ้นเส้น",
            "แกงจืดวุ้นเส้น","แกงไตปลา","แกงป่าไก่","แกงเผ็ดไก่ใส่มะเขือ","แกงเผ็ดไก่ใส่หน่อไม้",
            "แกงเผ็ดเป็ดย่าง","แกงเผ็ดฟักทองหมู","แกงเผ็ดมะเขือไก่","แกงเผ็ดลูกชิ้นปลา","แกงเผ็ดหน่อไม้ไก่",
            "แกงเผ็ดหมูยอดมะพร้าว","แกงมัสมั่นไก่","แกงเลียง","แกงเลียงผักรวม","แกงส้ม",
            "แกงส้มชะอมไข่ทอดใส่กุ้ง","แกงส้มดอกแคกุ้ง","แกงส้มปลาช่อนผักบุ้ง","แกงส้มปลาแปะซะ","แกงส้มผักกะเฉดปลา",
            "แกงส้มผักรวม","แกงหมูเทโพ","แก้วมังกร(ลูก)","โกยซีหมี่","ไก่ตุ๋นมะนาวดอง",
            "ไก่ทอด(น่อง)","ไก่ผัดขิง","ไก่ย่าง(น่อง)","ขนมกล้วย","ขนมกลีบลำดวน",
            "ขนมเข่ง","ขนมครก(คู่)","ขนมจีน","ขนมจีนแกงเขียวหวานไก่","ขนมจีนซาวน้ำ",
            "ขนมจีนน้ำเงี้ยว","ขนมจีนน้ำพริก","ขนมจีนน้ำยา","ขนมจีนน้ำยาปักษ์ใต้","ขนมจีบหมู(ชิ้น)",
            "ขนมตาล","ขนมถั่วแปป(ชิ้น)","ขนมเทียน","ขนมบ้าบิ่น(ชิ้น)","ขนมเบื้องไทยไส้เค็ม(แผ่น)",
            "ขนมเบื้องไทยไส้หวาน(แผ่น)","ขนมเปียกปูน","ขนมผิง(ก้อนเล็ก)","ขนมฝักบัว(ชิ้น)","ข้าวกะเพราเนื้อ","ข้าวกุ้งทอดกระเทียม","ข้าวเกรียบกุ้ง(แผ่น)",
            "ข้าวเกรียบปากหม้อ(ชิ้น)","ข้าวแกงกะหรี่ไก่","ข้าวแกงเผ็ดไก่","ข้าวไก่อบ","ข้าวขาหมู","ข้าวไข่เจียว","ข้าวคลุกกะปิ",
            "ข้าวซอยไก่","ข้าวซอยหมู","ข้าวต้ม(ข้าวกล้อง)","ข้าวต้ม(ข้าวขาว)","ข้าวต้มทรงเครื่อง","ข้าวต้มปลา","ข้าวต้มมัด",
            "ข้าวตังหน้าตั้ง(แผ่น)","ข้าวตังหมูหยอง(แผ่น)","ข้าวผัดกระเพราหมูกรอบ","ข้าวผัดกะเพรากุ้ง","ข้าวผัดกะเพราไก่","ข้าวผัดกะเพราไก่ไข่ดาว","ข้าวผัดกะเพราหมู",
            "ข้าวผัดกุ้งใส่ไข่","ข้าวผัดกุนเชียง","ข้าวผัดแกงเขียวหวานไก่","ข้าวผัดคะน้าหมูกรอบ","ข้าวผัดต้มยำทะเลแห้ง","ข้าวผัดน้ำพริกกุ้งสด","ข้าวผัดน้ำพริกเผาหมู",
            "ข้าวผัดน้ำพริกลงเรือ","ข้าวผัดปลาเค็ม","ข้าวผัดปลาหมึกน้ำพริกเผา","ข้าวผัดปูใส่ไข่","ข้าวผัดผักกระเฉดหมูกรอบ","ข้าวผัดรวมมิตร(น้ำมันน้อย)","ข้าวผัดสับปะรด","ข้าวผัดไส้กรอก","ข้าวผัดหมูน้ำพริกเผา","ข้าวผัดหมูใส่ไข่","ข้าวผัดแหนม","ข้าวผัดอเมริกัน",
            "ข้าวพะแนงเนื้อ","ข้าวโพดต้ม(ฝัก)","ข้าวมันไก่","ข้าวมันไก่ทอด","ข้าวเม่าทอด","ข้าวยำปักษ์ใต้","ข้าวราดแกงเขียวหวานไก่","ข้าวราดหน้าไก่","ข้าวสตูว์ไก่","ข้าวสวย","ข้าวสวย(ข้าวกล้อง)","ข้าวสวย(ข้าวขาว)",
            "ข้าวหน้ากุ้งผัดพริดสด","ข้าวหน้าเป็ด","ข้าวหมกไก่","ข้าวหมูแดง","ข้าวหมูทอด","ข้าวหมูทอดกระเทียม","ข้าวหมูอบ","ข้าวเหนียวกะทิทุเรียน","ข้าวเหนียวดำ","ข้าวเหนียวตัด","ข้าวเหนียวมูลกะทิ","ข้าวเหนียวหน้าสังขยา",
            "ข้าวเหนียวหมูทอด","ข้าวเหนียวหมูสวรรค์","ไข่เค็ม","ไข่เจียว","ไข่ดาว","ไข่ดาวทรงเครื่อง","ไข่ต้ม","ไข่ตุ๋น","ไข่ตุ๋นทรงเครื่อง","ไข่นกกระทา","ไข่พะโล้","ไข่ยัดไส้",
            "ไข่ลวก","ไข่ลูกเขย","ครัวซอง","คอหมูย่าง","คะน้าหมูกรอบ","เครื่องในไก่ผัดขิง","แคนตาลูป(ชิ้น)","เงาะ(ลูก)","โจ๊กใส่ไข่","โจ๊กหมู","โจ๊กหมูตับ ใส่ไข่ลวก","เฉาก๊วย",
            "ชมพู่","เชอรี่","ซาลาเปาทอด","ซาลาเปาไส้หมู","ซุปข้าวโพด","ซุปหน่อไม้","ต้มข่าไก่","ต้มโคล้งปลากรอบ","ต้มจับฉ่าย","ต้มจืดเลือดหมู","ต้มผักกาดดองซี่โครงหมู","ต้มยำกุ้ง",
            "ต้มยำไก่","ต้มยำปลากระป๋อง","ต้มยำปลากระพง","ต้มยำปลาทู","ต้มยำปลาหมึก","ต้มยำเห็ดสด","ตะโก้แห้ว","ตับไก่ปิ้ง","เต้าส่วน","เต้าหู้ไข่","เต้าหู้ทอด","เต้าหู้นมสด",
            "เต้าฮวยน้ำขิง","แตงไทย(ชิ้น)","ถั่วทอด(แพ)","ทองม้วน","ทอดมันกุ้ง","ทอดมันปลากราย","ทับทิมกรอบ","ทุเรียน(เม็ด)","ทุเรียนทอดกรอบ(ชิ้น)","น้อยหน่า","น้ำกระเจี๊ยบ","น้ำโค้ก, น้ำเป๊ปซี่",
            "น้ำพริกกะปิผักสด","น้ำพริกกุ้งเผา","น้ำพริกมะม่วง","น้ำพริกลงเรือ","น้ำพริกหนุ่ม","น้ำพริกอ่อง","น้ำมะเขือเทศ","น้ำมะตูม","น้ำมะนาว","น้ำมะพร้าว","น้ำลำใย","น้ำส้มคั้น",
            "น้ำสับปะรด","น้ำองุ่น","น้ำอ้อย","บะจ่าง","บะหมี่กรอบราดหน้า","บะหมี่กรอบราดหน้ารวมมิตร","บะหมี่กึ่งสำเร็จรูป","บะหมี่น้ำเกี๊ยวหมูแดง","บะหมี่น้ำต้มยำหมู","บะหมี่น้ำน่องไก่","บะหมี่หมูแดง","บะหมี่แห้งหมูแดง",
            "บัวลอย","บัวลอยเผือก","ปลาช่อนทอด","ปลาซาบะย่าง","ปลาแซลมอนย่าง","ปลาทอดสามรส","ปลาทูทอด","ปลานึ่ง","ปลาเผา","ผัดไทยกุ้งสด","ผัดไทยห่อไข่","ผัดบร็อกโคลี่กุ้ง",
            "ผัดเปรี้ยวหวานไก่","ผัดผักกระเฉดน้ำมันหอย","ผัดผักกาดขาวหมูวุ้นเส้น","ผัดผักกาดดองใส่ไข่","ผัดผักคะน้าน้ำมันหอย","ผัดผักบุ้งไฟแดง","ผัดผักรวมหมู","ผัดเผ็ดมะเขือหมู","ผัดพริกแกงหมูหน่อไม้",
            "ผัดมักกะโรนีกุ้ง","ผัดมักกะโรนีหมู","ผัดยอดมะระน้ำมันหอย","ผัดวุ้นเส้นใส่ไข่","ผัดหมี่ซั่ว","ฝรั่ง",
            "ฝอยทอง(แพ)","เฟร้นฟราย","ยำกุนเชียง","ยำขนมจีน","ยำไข่ต้ม","ยำถั่วพู","ยำปลากระป๋อง","ยำปลาดุกฟู","ยำผักกะเฉด","ยำผักบุ้งทอดกรอบ","ยำมะเขือยาว","ยำมาม่า","ยำรวมมิตรทะเล","ยำวุ้นเส้น","ยำหมูย่าง",
            "ราดหน้าบะหมี่กรอบ","ราดหน้าเส้นใหญ่หมู","ราดหน้าหมูหมี่กรอบ","โรตี","ลอดช่องน้ำกะทิ","ลอดช่องสิงคโปร์","ลาบไก่","ลาบเนื้อ","ลาบปลา","ลาบหมู","ลำไย","ลิ้นจี่","ลูกเกด(เม็ด)","ลูกชิ้นทอด(ลูก)","ลูกชิ้นปลา",
            "สตรอวเบอร์รี่","สเต็กไก่ทอด + มันบด","สเต็กปลาย่าง","สเต็กหมู + ผักสลัด","สปาเกตตี้กะเพรากุ้ง","สปาเก็ตตี้ไก่อบ","ส้มตำไทย","ส้มตำปู","ส้มตำปูไทย","สลัดกุ้ง","สลัดไก่","สลัดปลาทูน่า","สับปะรด","สาคูไส้หมู(ลูก)","สุกี้น้ำไก่",
            "สุกี้แห้งทะเล","เส้นหมี่ลูกชิ้นน้ำใส","เส้นหมี่ลูกชิ้นหมูแห้ง","เส้นใหญ่ผัดซีอิ๊วใส่ไข่","ไส้กรอกอีสาน(ลูก)","หน่อไม้ผัดไข่","หมี่กรอบราดหน้าหมู","หมูกรอบ","หมูปิ้ง","หมูสะเต๊ะ","อกไก่ย่าง","อกไก่อบ","องุ่น","แอปเปิ้ล","ขนมปังกระเทียม(ชิ้น)",
            "ขนมปังสังขยา","ขนมปังไส้กรอก","ครีมโรล","คุ้กกี้ข้าวโอ๊ต(ชิ้น)","คุ้กกี้ชาเขียว(ชิ้น)","คุ้กกี้ช็อคโกแลตชิพ(ชิ้น)","คุ้กกี้สิงคโปร์(ชิ้น)","คุ้กกี้เนย(ชิ้น)","คุ้กกี้ไส้สับปะรด(ชิ้น)","ชาดำเย็น","ชามะนาว","ชาเย็น","ช็อคโกแลตร้อน","พายชีสบูลเบอร์รี่","พายทูน่า",
            "พิซซ่าขอบไส้กรอกชีส(ชิ้น)","พิซซ่าฮาวายเอี้ยน(ชิ้น)","พิซซ่าไส้กรอก(ชิ้น)","เค้กกล้วยหอม(ชิ้น)","เค้กช็อคโกแลต(ชิ้น)","เค้กเนย(ชิ้น)","เค้กใบเตย(ชิ้น)","แซนวิชแฮมชีส","แซนวิชทูน่า","แซนวิชไก่","แยมโรล","แฮมเบอร์เกอร์ไก่ชีส","แฮมเบอร์เกอร์หมู",
            "โดนัท(ชิ้น)","โรตีสายไหม","ไอศกรีมกะทิ(ก้อน)","ไอศกรีมกาแฟ(ก้อน)","ไอศกรีมชอกโกแล็ต(ก้อน)"," ไอศกรีมวนิลลา(ก้อน)","ไอศกรีมสตรอเบอรี่(ก้อน)",

    };
    String[] unitStrings = new String[]{
            "ชาม", "ชาม",
            "ลูก", "ถ้วย", "ชิ้น", "ผล",
            "ชิ้น", "ลูก", "ถ้วยเล็ก", "ผล",
            "ลูก", "ชาม", "ชาม", "จาน", "ถ้วย",
            "จาน", "จาน", "จาน", "ชาม",
            "ชาม", "ชาม", "ชาม", "ชาม", "ชาม",
            "จาน","ชาม","จาน","จาน","จาน","ชิ้น",
            "ตัว","ตัว","ตัว","จาน","จาน","แพ","จาน",
            "ชิ้นเล็ก","ชิ้น", "ถ้วย","ชาม","จาน","ชิ้น",
            "ชาม","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย",
            "ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย",
            "ถ้วย","ชิ้น","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย",
            "ถ้วย","ถ้วย","ชาม","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ชาม","ถ้วย","ถ้วย",
            "ลูก","จาน","ชาม","น่อง","จาน","น่อง","ห่อ","ชิ้น","กระทง","คู่","ทัพพี","ชาม",
            "จาน","ถ้วย","จาน","จาน","จาน","ชิ้น","กระทง","ชิ้น","ห่อ","ชิ้น","แผ่น",
            "แผ่น","จานเล็ก","ก้อนเล็ก","ชิ้น","จาน","จาน","แผ่น",
            "ชิ้น","จาน","จาน","จาน","จาน","จาน","จาน",
            "ชาม","ชาม","ถ้วย","ถ้วย","ถ้วย","ถ้วย","มัด",
            "แผ่น","แผ่น","จาน","จาน","จาน","จาน","จาน",
            "จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน",
            "จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน",
            "จาน","จาน","ฝัก","จาน","จาน","ชิ้น","จาน","จาน","จาน","จาน",
            "ทัพพี","ทัพพี","ทัพพี","จาน","จาน","จาน","จาน","จาน","จาน","จาน",
            "ถ้วย","ถ้วยเล็ก","ชิ้น","จานเล็ก","จานเล็ก","ชุด","ชุด","ฟอง","ฟอง","ฟอง",
            "ฟอง","ฟอง","ฟอง","ฟอง","จานเล็ก","ถ้วย","จาน","ฟอง","ฟอง","ชิ้น",
            "จาน","จาน","จาน","ชิ้น","ลูก","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ผล","ผล","ลูก","ลูก","ถ้วย","จาน",
            "ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","ถ้วย","กระทง","ไม้","ถ้วย","หลอด",
            "ชิ้น","ถ้วย","ถ้วย","ชิ้น","แพ","อัน","จาน","ชิ้น","ถ้วย","เม็ด","ชิ้น","ลูก","แก้ว","แก้ว","ช้อนโต๊ะ",
            "ถ้วย","ถ้วย","ถ้วย","ช้อนโต๊ะ","ช้อนโต๊ะ","แก้ว","แก้ว","แก้ว","แก้ว","แก้ว","แก้ว","แก้ว","แก้ว","แก้ว","ลูก",
            "จาน","จาน","ก้อน","ชาม","ถ้วย","ชาม","ชาม","ชาม","ถ้วยเล็ก","ถ้วย","ตัว","ตัว","จาน","ตัวกลาง","ตัวกลาง",
            "ตัว","ตัว","จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน",
            "จาน","จาน","จาน","จาน","ผล","แพ","ชิ้น","จาน","จาน","ฟอง","จาน","จาน","จาน","จาน","จาน",
            "จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน","ชิ้น","ถ้วย","ถ้วย","จาน","จาน","จาน","จาน",
            "เม็ด","ลูก","เม็ด","ลูก","ลูก","ผล","จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน","จาน",
            "จาน","จาน","ชิ้นเล็ก","ลูก","ชาม","ชาม","ชาม","ชาม","จาน","ลูก","จาน","จาน","จาน","จาน","ไม้",
            "ไม้","ชิ้น","ชิ้น","เม็ด","ลูก","ชิ้น","ชิ้น","ชิ้น","ชิ้น","ชิ้น","ชิ้น","ชิ้น","ชิ้น","ชิ้น","ชิ้น",
            "แก้ว","แก้ว","แก้ว","แก้ว","ชิ้น","ชิ้น","ชิ้น","ชิ้น","ชิ้น","ชิ้น","ชิ้น","ชิ้น","ชิ้น","คู่",
            "คู่","คู่","ชิ้น","ชิ้น","ชิ้น","ชิ้น","ชิ้น","ก้อน","ก้อน","ก้อน","ก้อน","ก้อน",};
    String[] caloriesStrings = new String[]{
            "150",
            "225",
            "40",
            "100",
            "29",
            "30",
            "50",
            "36",
            "152",
            "30",
            "77",
           "240",
            "235",
            "435",
            "320",
            "440",
            "577",
            "435",
            "180",
            "225",
            "375",
            "420",
            "335", "330","226","258","520","397",
            "397","50","157","14","86","124",
            "235","308","300","120","114","300",
            "225","635","63","275","165","450",
            "325","195","245","240","240","235",
            "120","90","80","110","50","50","90",
            "90","66","85","50","110","235","245","240","250","235","240",
            "245","245","325","115","48","28","270","105","105","160","110",
            "120","300","60","550","110","345","210","165","120","23","120",
            "92","80","594","320","243","228","332","146","32","58","14",
            "103","130","50","60","195","5","70","622","495","37",
            "26","389","485","490","690","445","410","395","395","120","120","230","325","285",
            "90","80","650","540","554","630","580","595","590","630","670","400","460","665",
            "605","405","535","610","600","210","335","520","370","665","557","610","790","457",
            "200","596","695","209","248","483","400","465","68","80","80","540","495","534",
            "541","416","525","389","225","205","210","197","223","440","480","75","215","215","250",
            "73","75","159","191","180","310","75","205","235","200","420","200","4","12","250",
            "160","230","90","16","15","157","202","140","40","210","60","15","120","90","65",
            "60","55","80","10","9","78","60","215","70","57","150","130","4","82","35",
            "255","37","250","59","9","61","120","100","28","90","100","195","18","80","48",
            "120","100","120","100","160","125","112","240","300","515","690","253","305","300","375",
            "231","345","223","300","1840","220","260","470","280","156","156","486","565",
            "210","215","185","230","205","210","210","210","250","200","420","514","185",
            "265","395","174","146","20","220","220","105","185","55","275","115","310",
            "35","215","132","120","165","515","405","690","192","210","215","125","119",
            "94","119","8","17","4","35","4","60","615","260","505","485","430",
            "55","35","118","92","97","122","8","51","345","280","225","430","520",
            "90","200","690","560","125","115","110","169","16","42","85","230","130",
            "360","75","75","215","95","105","190","110","100","100","120","350","280",
            "340","345","290","370","275","255","250","290","180","240","310","280","245",
            "270","145","108","142","110","140","110",};
    String[] exerciseStrings = new String[]{"กระโดดเชือก","กวาดพื้น","เต้น Zumba","ขี่จักรยาน","ซักผ้าด้วยมือ","ตัดหญ้า","ตีกอล์ฟ ลากถุงกอล์ฟ","ตีกอล์ฟ แบกถุงกอล์ฟเอง",
            "ตีกอล์ฟ, นั่งรถ","ทำงานบ้าน","ทำสวน","นอนหลับ","นั่งดูทีวี","นั่งทำงานใช้สมอง","บาสเก็ตบอล","ปูที่นอน",
            "มวยไทย","ยืน","รีดผ้า","ลงนอน(ไม่หลับ)","วิ่งเร็ว","วิ่งเหยาะๆ","ว่ายน้ำ","เดินขึ้นบันได",
            "เดินขึ้นเนิน","เดินช้า","เดินธรรมดา","เดินลงบันได","เดินลงเนิน","เดินเร็ว","เดินเล่น","เต้นรำ",
            "เย็บผ้า","เลื่อยไม้","เล่นวอลเล่ย์บอล","เล่นสเก็ตปกติ","เล่นสเก็ตแข่งความเร็ว","เล่นฮูล่าฮูป","เล่นเทนนิสคู่","เล่นเทนนิสเดี่ยว",
            "เล่นแบดมินตัน","เล่นโบว์ลิ่ง","แอโรบิค",};
    String[] burnStrings = new String[]{"780",
            "225",
            "500",
            "600",
            "240",
            "300",
            "300",
            "360",
            "240",
            "250","450","75","100","110","660",
            "135","800","140","150","85","1200","750",
            "750","1080","900","150","300","425","240",
            "480","210","350","115","515","300","420",
            "700","430","360","480","350","400","600",};

    int[] iconInts = new int[]{R.drawable.p1, R.drawable.p2, R.drawable.p3,
            R.drawable.p4, R.drawable.p5, R.drawable.p6, R.drawable.p7};

    public int[] getIconInts() {
        return iconInts;
    }

    public String[] getFoodStrings() {
        return foodStrings;
    }

    public String[] getUnitStrings() {
        return unitStrings;
    }

    public String[] getCaloriesStrings() {
        return caloriesStrings;
    }

    public String[] getExerciseStrings() {
        return exerciseStrings;
    }

    public String[] getBurnStrings() {
        return burnStrings;
    }

} // MyData Class
